import 'package:std/features/map/domain/entities/all_map_entities.dart';

class DescriptionMapEntities {
  static List<DescriptionMapEntity> mapEntity = [
    DescriptionMapEntity(
      name: 'Ростовская областная клиническая больница',
      image: 'https://avatars.mds.yandex.net/get-altay/4797538/2a00000178da759ae94b412cd1cb5cb29c37/L_height',
      street: '',
      description:
          'Государственное бюджетное учреждение Ростовской области «Ростовская областная клиническая больница» (РОКБ) – на сегодня один из крупнейших в регионе многопрофильных лечебно-консультативных центров',
      workingTime: 'с 9.00 до 16.30',
      shirota: 47.2235094,
      dolgota: 39.6193199,
    ),
    DescriptionMapEntity(
      name: 'ГБ № 1 им. Н. А. Семашко',
      image: 'https://avatars.mds.yandex.net/get-altay/5483032/2a0000017fc2a26dc45888a854756f19405e/L_height',
      street: 'Ворошиловский просп., 105/23.',
      description:
          'ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ РОСТОВСКОЙ ОБЛАСТИ «ЦЕНТРАЛЬНАЯ ГОРОДСКАЯ БОЛЬНИЦА ИМ. Н.А. СЕМАШКО» В Г. РОСТОВЕ-НА-ДОНУ',
      workingTime: 'с 9.00 до 16.30',
      shirota: 47.2331960,
      dolgota: 39.7108000,
    ),
    DescriptionMapEntity(
      name: 'Южный окружной медицинский центр, Ростовская клиническая больница',
      image: 'https://vodnik61.ru/upload/images/bolnica/6_1.jpg',
      street: 'улица Пешкова, 34',
      description: 'Центр оказания мединской помощи. Одна из самых чистых больни',
      workingTime: 'Круглосуточно ',
      shirota: 47.247103,
      dolgota: 39.743534,
    ),
    DescriptionMapEntity(
      name: 'Городская больница № 6',
      image: 'https://gb6-rostov.ru/images/gb_1.jpg',
      street: 'ул. Сарьяна, 85/38',
      description:
          'ГБУ РО «ГБ №6» в  г. Ростове-на-Дону одна из старейших больниц Ростова. В 1928 году был основан «Единый диспансер №3» Ленинского района, а с 1950 года преобразован в городскую больницу на 100 коек, которая была объединена с поликлиникой №4 и консультацией №9 с наименованием «Районная больница Железнодорожного района». В 1952г.  Районная больница Железнодорожного района переименована  в «Городскую больницу №6».',
      workingTime: 'Круглосуточно ',
      shirota: 47.229956,
      dolgota: 39.778536,
    ),
    DescriptionMapEntity(
      name: 'Лечебно-реабилитационный центр №1 Дворец здоровья',
      image: 'https://like.doctor/uploads/clinics/449/22449.jpg?849',
      street: 'Малюгиной ул, 100',
      description:
          'Лечебно-реабилитационный центр №1 Дворец здоровья, Ростов-на-Дону: 18 отзывов пациентов, 34 отзыва о врачах, средняя оценка пользователей: 4.9, цены на услуги не указаны. Официальное название ГБУ РО ЛРЦ №1, руководитель Ходарев Сергей Владимирович, год основания 1947, официальный сайт доступен. Лицензия ЛО-61-01-004649.',
      workingTime: 'Круглосуточно ',
      shirota: 47.2284950,
      dolgota: 39.6953780,
    ),
    DescriptionMapEntity(
      name: 'Ростовский научно-исследовательский онкологический институт',
      image: 'https://like.doctor/uploads/clinics/222/23222.jpg?3447',
      street: '14 Линия ул, 63',
      description:
          'Ростовский научно-исследовательский онкологический институт, Ростов-на-Дону: 103 отзыва пациентов, 6 отзывов о врачах, средняя оценка пользователей: 5, цены на услуги не указаны. Официальное название ФГБУ РНИОИ Минздрава России, руководитель Кит Олег Иванович, год основания 1928, официальный сайт доступен. Лицензия ФС-61-01-002229.',
      workingTime: 'Круглосуточно ',
      shirota: 47.2376000,
      dolgota: 39.7549700,
    ),
    DescriptionMapEntity(
      name: 'Городская больница №8',
      image: 'https://like.doctor/uploads/clinics/984/19984.jpg?261',
      street: 'Островского пер, 42',
      description:
          'Городская больница №8, Ростов-на-Дону: 9 отзывов пациентов, 1 отзыв о врачах, средняя оценка пользователей: 5, цены на услуги не указаны. Официальное название МБУЗ Городская больница №8, руководитель Дрозд Александр Александрович, год основания 1954, официальный сайт доступен. Лицензия ЛО-61-01-006215.',
      workingTime: 'Круглосуточно ',
      shirota: 47.22671,
      dolgota: 39.70526,
    ),
    DescriptionMapEntity(
      name: 'Городская больница №4',
      image: 'https://like.doctor/uploads/clinics/321/24321.jpg?2533',
      street: 'Богатяновский Спуск пр-кт, 27',
      description:
          'Городская больница №4, Ростов-на-Дону: 14 отзывов пациентов, 14 отзывов о врачах, средняя оценка пользователей: 5, цены на услуги не указаны. Официальное название МБУЗ ГБ №4 г. Ростова-на-Дону, руководитель Зайцев Павел Павлович, год основания 1881, официальный сайт доступен. Лицензия ЛО-61-01-006541.',
      workingTime: 'Круглосуточно ',
      dolgota: 39.730410,
      shirota: 47.223351,
    ),
    DescriptionMapEntity(
      name: 'Дорожная клиническая больница на ст Ростов-Главный',
      image: 'https://like.doctor/uploads/clinics/321/24321.jpg?2533',
      street: 'Варфоломеева ул, 92а',
      description:
          'Дорожная клиническая больница на ст Ростов-Главный, Ростов-на-Дону: 58 отзывов пациентов, 12 отзывов о врачах, средняя оценка пользователей: 5, цены на услуги не указаны. Официальное название НУЗ ДКБ на ст. Ростов-Главный ОАО РЖД, руководитель Нахрацкая Ольга Ивановна, год основания 1911, официальный сайт доступен. Лицензия ЛО-61-01-006904.',
      workingTime: 'Круглосуточно ',
      shirota: 47.22661,
      dolgota: 39.68833,
    ),
    DescriptionMapEntity(
      name: 'Городская больница скорой медицинской помощи',
      image: 'https://like.doctor/uploads/clinics/25/24025.jpg?1159',
      street: 'Бодрая ул, 88/35',
      description:
          'Городская больница скорой медицинской помощи, Ростов-на-Дону: 177 отзывов пациентов, 21 отзыв о врачах, средняя оценка пользователей: 5, цены на услуги не указаны. Официальное название МБУЗ ГБСМП г. Ростова-на-Дону, руководитель Литвинов Борис Иванович, год основания 1987, официальный сайт доступен. Лицензия ЛО-61-01-006870.',
      workingTime: 'Круглосуточно ',
      shirota: 47.22635,
      dolgota: 38.888518,
    ),
    DescriptionMapEntity(
      name: 'Городская больница №20',
      image: 'https://like.doctor/uploads/clinics/321/24321.jpg?2533',
      street: 'Коммунистический пр-кт, 39',
      description:
          'Городская больница №20, Ростов-на-Дону: 55 отзывов пациентов, 31 отзыв о врачах, средняя оценка пользователей: 5, цены на услуги не указаны. Официальное название МБУЗ ГБ №20 г. Ростова-на-Дону, руководитель Дронов Юрий Иванович, год основания 1993, официальный сайт доступен. Лицензия ЛО-61-01-006344',
      workingTime: 'Круглосуточно',
      shirota: 47.20578,
      dolgota: 39.62304,
    ),
  ];
}
